src/cf/Enums/СистемыНалогообложения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СистемыНалогообложения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Общая</Name>
					<Comment>ОСН</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Упрощенная</Name>
					<Comment>УСН</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОсобыйПорядок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогНаПрофессиональныйДоход</Name>
					<Comment>НПД</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АУСН</Name>
					<Comment>Автоматизированная УСН</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/СистемыНалогообложения/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ОсновнаяСистемаНалогообложения(ДляФизЛица = Ложь) Экспорт
	
	РазрешенныеСистемыНалогообложения = РазрешенныеСистемыНалогообложения(ДляФизЛица);
	Если РазрешенныеСистемыНалогообложения.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОсновнаяСистемаНалогообложения = Константы.ОсновнаяСистемаНалогообложения.Получить();
	
	Если Не ЗначениеЗаполнено(ОсновнаяСистемаНалогообложения)
		Или РазрешенныеСистемыНалогообложения.Найти(ОсновнаяСистемаНалогообложения) = Неопределено Тогда
		
		ОсновнаяСистемаНалогообложения = РазрешенныеСистемыНалогообложения[0];
	КонецЕсли;
	
	Возврат ОсновнаяСистемаНалогообложения;
	
КонецФункции

Функция ДатаНачалаПрименения(СистемаНалогообложения, ПрименяетсяУСНПатент = Ложь) Экспорт
	
	Если СистемаНалогообложения = НалогНаПрофессиональныйДоход Тогда
		Возврат НалогНаПрофессиональныйДоходКлиентСервер.ДатаНачалаЭксперимента();
	ИначеЕсли ЭтоПатентнаяСистемаНалогообложения(СистемаНалогообложения, ПрименяетсяУСНПатент) Тогда
		Возврат УчетПСН.ДатаНачалаДействияПатентнойСистемы();
	ИначеЕсли СистемаНалогообложения = АУСН Тогда 
		Возврат НачалоГода(УчетУСНПовтИсп.ДатаНачалаПримененияАУСН());
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЭтоПатентнаяСистемаНалогообложения(СистемаНалогообложения, ПрименяетсяУСНПатент)
	
	Возврат СистемаНалогообложения = ОсобыйПорядок И ПрименяетсяУСНПатент;
	
КонецФункции

Функция РазрешенныеСистемыНалогообложения(ДляФизЛица)
	
	// Возвращаем в том порядке, в котором располагаются настройки системы налогообложения
	СистемыНалогообложения = Новый Массив;
	Если ДляФизЛица Тогда
		Если ТарификацияБП.РазрешенНалогНаПрофессиональныйДоход() Тогда
			СистемыНалогообложения.Добавить(НалогНаПрофессиональныйДоход);
		КонецЕсли;
		Если ТарификацияБП.РазрешенаПатентнаяСистемаНалогообложения() Тогда
			СистемыНалогообложения.Добавить(ОсобыйПорядок);
		КонецЕсли;
	КонецЕсли;
	Если ТарификацияБП.РазрешенаАУСН() Тогда
		СистемыНалогообложения.Добавить(АУСН);
	КонецЕсли;
	Если ТарификацияБП.РазрешенаУСН() Тогда
		СистемыНалогообложения.Добавить(Упрощенная);
	КонецЕсли;
	Если ТарификацияБП.РазрешенаОбщаяСистемаНалогообложения() Тогда
		СистемыНалогообложения.Добавить(Общая);
	КонецЕсли;
	
	Возврат СистемыНалогообложения;
	
КонецФункции

#КонецОбласти

#КонецЕсли
